
#include "solo.h"
int main(void)
{

    puts("■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■");
    puts("□                                                                       □");
    puts("■                                                      고고 키티 건     ■");
    puts("□                          __,,,,_                   \t\t\t□");
    puts("■            _ ___.--'''`--''// ,-_ `-.              \t\t\t■");
    puts("□        \\`\"' ' |  \\  \\ \\/ / // / ,-  `,_            \t\t\t□");
    puts("■       /'`  \\   |  Y  | \\|/ / // / -.,__ `-.        \t\t\t■");
    puts("□      /<\"\\    \\ \\  |  | ||/ // | \\/    |`-._`-._    \t\t\t□");
    puts("■     /  _.-.  .-\\,___|  _-| / \\ \\/|_/  |    `-._    \t\t\t■");
    puts("□     `-'  f/ |       / __/ \\__  / |__/ |            \t\t\t□");
    puts("■          `-'       |  -| -|\\__ \\  |-' |            \t1. 시작하기\t■");
    puts("□                 __/   /__,-'    ),'  |'            \t\t\t□");
    puts("■                ((__.-'((____..-' \\__,'             \t2. 종료하기\t■");
    puts("□                                                                       □");
    puts("■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■  □  ■");

    cout << "\n게임을 시작합니다.\n이름을 입력해주세요: ";
    cin >> solo.name; // 이름 입력
        start(solo);    
    cout << "종료되었습니다.\n";

    return 0;
}
